Repository: wescamp/Two_Brothers-root
Catalog: po/*.po
Languages: sv

source: A Tale Of Two Brothers
sv: Sagan om två bröder

source: (easy)
sv: (lätt)

source: Horseman
sv: Ryttare

source: (hard)
sv: (svårt)

source: Knight
sv: Riddare

source: A Black Mage is threatening the local village and its inhabitants. When their leader Bjarn sends for aid from his brother Arne, he is victorious, but Bjarn himself is kidnapped. Can you rescue him? A very short campaign. Suitable for beginners.
sv: En svartmagiker hotar en by och dess invånare. När deras ledare, Bjarn skickar efter sin bror Arne för att hjälpa dem, så går denne segrande ur striden, men Bjarn blir kidnappad. Kan du rädda honom? En mycket kort kampanj. Lämplig för nybörjare.

source: Rooting Out A Mage
sv: Fördriva en magiker

source: Slay the Black Mage
sv: Döda svartmagikern

source: Death of Arne
sv: Arne dör

source: Turns run out
sv: Dragen tar slut

source: Peasant
sv: Bonde

source: Villager
sv: Bybo

source: The Black Mage
sv: Svartmagikern

source: In a remote part of Wesnoth, people lived their lives working hard and caring for each other, but not knowing much about the world outside. One day, however, their peaceful world was shattered, as an evil mage came to the region, spreading havoc and despair.
sv: I ett avlägset hörn av Wesnoth så bodde det folk, som arbetade hårt och tog hand om varandra, men som visste lite om världen utanför. Men så en dag krossades deras värld då en ond magiker kom till trakten och kaos och fruktan följde i hans spår.

source: Bjarn, the local mage of the village, was the man who saw best how to deal with this threat. He asked the help of his brother Arne, leader of a mercenary band of horsemen, and outfitted several of the villagers with gear from the armory.
sv: Bjarn, byns magiker, var den som bäst förstod hur man skulle ta itu med hotet. Han bad sin bror Arne, som ledde en trupp av beridna legosoldater, om hjälp. Han så också till att flera av byborna fick vapen och rustningar från byns vapenförråd.

source: 'ello there, Bjarn. So, what's the big fuss?
sv: Men hej där Bjarn. Så vad är problemet egentligen?

source: An evil mage, one day's ride north, is posing a threat to our livelihoods. He is terrorizing our countryside. I've already called the village to arms and now it's up to you to lead them.
sv: Den där onde magikern som driver omkring en dagsritt norrut. Han sprider skräck överallt. Jag har redan mobiliserat byborna, men du måste leda dem.

source: Very well. We will go there and slay this source of evil. Charge, men!
sv: Nåväl. Då går vi och förgör denna ondska. Framåt, mannar!

source: After a short journey the small band of troops is close to the hideout of the evil mage.
sv: Efter en kort resa befinner sig den lilla styrkan i närheten av den onda magikerns gömställe.

source: I will attempt to sneak through the forest. If I can slay the evil one while he is off his guard, the battle will be over in one stroke!
sv: Jag försöker smyga mig igenom skogen. Om jag kan döda den onde när han inte är på sin vakt, så kommer striden att vara över i ett nafs.

source: Bjarn should have been in position by now. I wonder if anything's happened to him?
sv: Bjarn borde ha kommit fram nu. Jag undrar om någonting hänt honom?

source: This is worrying. What's happened to Bjarn? I suppose we must slay the necromancer ourselves.
sv: Detta är oroväckande. Vad har hänt med Bjarn? Jag antar att vi måste döda nekromantikern själva.

source: Good work, men. Now, where is Bjarn?
sv: Bra gjort, mannar. Men var har nu Bjarn tagit vägen?

source: Worried about him, are you? E-he-he..hergh...gaargh. . .
sv: Är du orolig för honom, va? Hi-hi-hi...haargh...

source: Nothing more to be had from him.
sv: Det går inte att få ut något mer ur honom.

source: Sir, he's been kidnapped! I just saw some men running off with him. They looked like friends of this one.
sv: Ers nåd, han har blivit kidnappad! Jag såg precis några män som sprang iväg med honom. De såg ut som vänner till den här.

source: Damn! I suppose we have to go after him, then.
sv: Tusan! Jag antar att vi måste hämta hem honom då.

source: Ha, so you thought to send a mage around and stab me in the back? Well, I have news for you. We've kidnapped him!
sv: Ha, så ni trodde att ni skulle kunna skicka en magiker att lägga sig i bakhåll för mig? Då har jag något nytt att berätta för er. Vi har kidnappat honom!

source: What? Bjarn kidnapped? And the black mage still ravages the land? Noooo!
sv: Va? Är Bjarn kidnappad? Och svartmagikern härjar fortfarande fritt? Neeej!

source: I hear these creatures are near immune to our weapons, let us see!
sv: Jag har hört att den här sortens varelser nästan alls inte tar skada av den sorts vapen vi har. Men vi får väl pröva!

source: That wasn't so hard!
sv: Det var ju inte så svårt!

source: Everything is lost now that I am dead...
sv: Nu när jag dör så är allt hopp ute...

source: The Chase
sv: Jakten

source: Fight your way through the woods before the kidnappers escape
sv: Kämpa dig fram genom skogen innan kidnapparna hinner undan

source: The kidnappers fled north through the forest, and Arne made to follow them, although his horsemen would be at a disadvantage.
sv: Kidnapparna flydde norrut, genom skogen, och Arne förberedde sig för att följa efter, även om hans ryttare inte skulle få det lätt i sådan terräng.

source: Sounds of a scuffle were heard from the forest.
sv: Ljudet av strid hördes från skogen.

source: Come on men. Some greenery never hurt anyone, did it?
sv: Kom nu mannar. Lite grönska har väl aldrig skadat någon?

source: You there! Halt and explain yourself.
sv: Ni där! Halt, förklara vad ni gör här.

source: We're chasing after some men who kidnapped my brother!
sv: Vi är på jakt efter några män som har kidnappat min bror!

source: No men have come this way, and you will not be the first. Die!
sv: Ingen har passerat här, och ni kommer sannerligen inte att bli de första. Dö!

source: A glorious combat at last, against mounted enemies!
sv: Till sist en ärorik strid, mot beridna fiender!

source: I see them! There they are!
sv: Jag ser dem! Där är de!

source: Curses! I hope the reinforcements get here so I can escape soon.
sv: Förbannelse! Jag hoppas truppförstärkningarna kommer snart så att jag kan komma undan.

source: Come on, men, let's catch those kidnappers!
sv: Kom nu mannar, låt oss fånga de där kidnapparna!

source: Hah! You got me alright, but what does that help? No harm telling you now, I suppose. Your precious mage is safely locked away in our dungeons. I was set up to be a decoy.
sv: Hah! Så ni har fångat mig. Men vad spelar det för roll. Det kvittar om jag berättar för er nu, antar jag. Er dyrbare magiker är redan inlåst i våra fängelsehålor. Jag skickades för att lura er på villovägar.

source: Nooo! Tricked again. Tell us where he is and we shall spare your miserable life.
sv: Nej, lurade igen. Berätta för oss var han finns, så skall vi spara ditt ynkliga liv.

source: Three days ride to the east, in the deserted castle. The passwords to the guards are Sithrak and Eleben.
sv: Tre dagars ritt österut, i den övergivna borgen. Lösen för vakterna är Sithrak och Eleben.

source: Thank you. Leave him, men, we ride East.
sv: Tackar. Låt honom gå, mannar, vi rider österut.

source: Wait, friend. We would like to join your cause!
sv: Vänta, vän. Vi skulle vilja slå följe med dig!

source: They would only slow us down!
sv: De kommer bara att sinka oss!

source: I make the decisions here.
sv: Det är jag som fattar besluten här.

source: Oh, all right then. Come along with us.
sv: Hm, nå väl, ni får komma med oss.

source: Thank you. My comrades and I will help you on your noble quest.
sv: Tack. Mina kamrater och jag skall hjälpa er på ert hedersamma uppdrag.

source: I am sorry. We have not the time to spare.
sv: Jag beklagar, vi har ingen tid att förlora.

source: Take this, then, for I see that you are on a quest. My comrades will help you whenever you call for them.
sv: Ta då detta, för jag kan se att ni är på ett nobelt uppdrag. Mina kamrater kommer att hjälpa er närhelst ni kallar på dem.

source: You receive 70 pieces of gold!
sv: Du får 70 guldstycken!

source: My reinforcements are here!
sv: Mina förstärkningar har anlänt!

source: He escaped us...
sv: Han kom undan...

source: Guarded Castle
sv: Bevakad borg

source: Rescue Bjarn
sv: Rädda Bjarn

source: Guard
sv: Vakt

source: Castle Guard
sv: Borgvakt

source: Arne arrived at the castle and was immediately challenged by some guards.
sv: Arne kom fram till borgen, och blev omedelbart stoppad av några vakter.

source: Halt! Friend or foe? Give the password.
sv: Halt! Vän eller fiende? Uppge lösen.

source: The password is
sv: Lösen är

source: Wrong! Die!
sv: Fel! Dö!

source: Oh dear, that's wrong. Any last words?
sv: Kära nån, det är fel. Har du några sista ord?

source: Pass, friend.
sv: Passera, vän.

source: Haha! We not kill people for long time. Weapon wants blood. We now kill humans!!
sv: Haha! Länge inte dödat människor. Vapen törstar efter blod. Nu vi döda människor!!

source: I knew that we had to fight to free my brother! Come on men, lets kill some orcs.
sv: Jag visste väl att vi skulle vara tvungna att slåss för att befria min bror! Kom nu mannar, låt oss ta kål på några orcher.

source: Are you our relief arriving? Does this mean we get to leave here now?
sv: Är ni vår avlösning? Kan vi ge oss av nu?

source: Um, yes. Fine. You can go.
sv: Öh, ja. Bra. Ni kan ge er av.

source: Um, you're supposed to give the password.
sv: Öh, det är meningen att ni skall ge lösen.

source: Oh, of course. I had nearly forgotten.
sv: Åh, visst ja. Jag glömde nästan.

source: Thanks! Irritating little formality, isn't it?
sv: Tack! En irriterande liten formalitet, eller hur?

source: Wrong! So you thought to trick us into deserting our posts? Die!
sv: Fel! Så, du trodde att du skulle kunna lura oss att överge våra poster? Dö!

source: Nooo! This is the end...
sv: Neeej! Det är slutet...

source: There's a key in his robes.
sv: Det finns en nyckel i hans kläder.

source: It must be the key to the cell they're holding Bjarn in! I will take the key. I can't wait to see my brother. Come on, let's free him.
sv: Det måste vara nyckeln till cellen där Bjarn är inlåst. Jag tar den.Nu vill jag träffa min bror igen. Kom, så befriar vi honom.

source: Look what I have found in here! I can count hundred pieces of gold.
sv: Titta vad jag har hittat! Så mycket som hundra guldstycken.

source: Look what I have found in here! I can count fifty pieces of gold.
sv: Titta vad jag har hittat! Så mycket som femtio guldstycken.

source: I found Bjarn. He is in this cell.
sv: Jag har hittat Bjarn. Han är i den här cellen.

source: Good to see you, Arne. Please help me to get out of this dungeon.
sv: Skönt att se dig, Arne. Hjälp mig ur de här fängelsehålorna, så är du snäll.

source: You must be one of Arne's men. Please help me to get out of this dungeon.
sv: Du måste vara en av Arnes mannar. Hjälp mig ur de här fängelsehålorna, så är du snäll.

source: The damn Necromancer Rotharik has imprisoned me behind this magical barrier. You must get the key from him to free me. You can only open it with the key.
sv: Den där fördömde nekromantikern Rotharik har fängslat mig med magi. Jag kan bara bli fri om du tar nyckeln ifrån honom. Endast nyckeln kan öppna dörren.

source: Thank you for coming to my aid. Let us return to the village.
sv: Tack för att ni räddade mig. Nu återvänder vi till byn.

source: You are too late! Your brother is already dead! Muhahahaha...
sv: För sent! Din bror är redan död! Mohahahaha....

source: Return to the Village
sv: Återkomsten till byn

source: Breaking Dawn
sv: Dagen gryr

source: Defeat the Lich
sv: Besegra häxmästaren

source: Death of Bjarn
sv: Bjarn dör

source: Councillor Hoban
sv: Rådman Hoban

source: There. Our village is just across those hills, and already I see men coming to greet us!
sv: Se där, vår by ligger precis på andra sidan kullarna, och jag kan redan se män som kommer för att välkomna oss!

source: No. They are fleeing from something. I see undead ahead! They have attacked our village!
sv: Nej. De flyr från någonting. Jag ser vandöda där borta! De anfaller vår by!

source: I think our friends are holding out well, though.
sv: Det ser ut som om våra vänner försvarar sig väl.

source: The undead are lead by a Lich. What a grim foe to face. Let us hold until dawn, and then strike!
sv: De vandöda leds av en häxmästare. En sådan förfärlig fiende att möta. Vi håller våra positioner tills dagen gryr, och då anfaller vi!

source: Look, the first rays of the sun break over the horizon! They are at their weakest now!
sv: Se, solens första strålar syns över horisonten! De är som svagast nu!

source: At last, our village is safe.
sv: Äntligen så är vår by i säkerhet.

source: It is over, I am vanquished.
sv: Allt är slut, jag är besegrad.

source: I don't think we can rescue anyone from these villages. It is too late.
sv: Jag tror inte vi kan rädda någon från dessa byar. Det är alltför sent.

source: I was too weak to protect these people. Oh why did this happen to me?!?
sv: Jag var alldeles för svag för att skydda dessa människor. Åh, varför skulle detta hända mig?!?
